tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Distributed revision control system
brew "git"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Asynchronous event library
brew "libevent"
# Postgres C API library
brew "libpq"
# Generic library support script
brew "libtool"
# Perl compatible regular expressions library
brew "pcre"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9", link: false
# SMART hard drive monitoring
brew "smartmontools"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# UNIX shell (command interpreter)
brew "zsh"
cask "font-fira-code"
cask "font-firacode-nerd-font"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Open-source code editor
cask "visual-studio-code"
