tap "adoptopenjdk/openjdk"
tap "clojure/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Generate compilation database for clang tooling
brew "bear"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Perl compatible regular expressions library
brew "pcre"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# OpenType text shaping engine
brew "harfbuzz"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Asynchronous event library
brew "libevent"
# Postgres C API library
brew "libpq"
# Generic library support script
brew "libtool"
# Powerful, lightweight programming language
brew "lua"
# Language Server for the Lua language
brew "lua-language-server"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Sample multi-channel audio mixer library
brew "sdl2_mixer"
# Library for using TrueType fonts in SDL applications
brew "sdl2_ttf"
# SMART hard drive monitoring
brew "smartmontools"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# UNIX shell (command interpreter)
brew "zsh"
cask "font-fira-code"
cask "font-firacode-nerd-font"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Open-source code editor
cask "visual-studio-code"
